{
  "backend/main.mo": "Motoko actor implementing user profiles, friend management, game result recording, and leaderboard functionality with persistent storage using Maps and Lists.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to source files, components, and test IDs for authentication, pages, and all four mini-games.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend TypeScript/React files describing routing, hooks, components, pages, and game implementations.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, including gaming-themed color tokens and sidebar styling.",
  "frontend/index.html": "HTML entry point with root div and module script import for the React application titled 'Arcade Arena'.",
  "frontend/src/App.tsx": "Main React app component configuring TanStack Router with routes for all pages and games, wrapped in ThemeProvider with dark theme and Toaster for notifications.",
  "frontend/src/components/games/MemoryCardGame.tsx": "Memory card matching game component with 4x4 grid, flip animations, move counter, matched pairs tracking, and backend score recording on game completion.",
  "frontend/src/components/games/NumberGuessingGame.tsx": "Number guessing game component (1-100) that tracks guess history with feedback (too high/low/correct), displays attempts and score, and records results to backend on successful completion.",
  "frontend/src/components/games/SnakeGame.tsx": "Snake game component using canvas rendering with arrow key controls, displays current score, and records game results to backend when the game ends.",
  "frontend/src/components/games/TicTacToeGame.tsx": "Tic-tac-toe game component with 3x3 grid, alternating X/O players, win/draw detection, and backend score recording on game completion.",
  "frontend/src/components/layout/Footer.tsx": "Footer component displaying brand info, social media links (Facebook, Twitter, Instagram, YouTube, GitHub), contact email, and copyright with caffeine.ai attribution.",
  "frontend/src/components/layout/Layout.tsx": "Main layout wrapper component that combines Navigation header, main content area, and Footer in a flex column structure.",
  "frontend/src/components/layout/Navigation.tsx": "Responsive navigation bar with logo, route links (Home, Games, Friends, Leaderboard, Profile), authentication state handling, and mobile sheet menu.",
  "frontend/src/components/profile/EditProfileModal.tsx": "Modal dialog for editing user profile (username and avatar URL) with placeholder functionality noting that backend profile updates are not yet implemented.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality, managing identity state through AuthClient and exposing authentication status and identity to child components.",
  "frontend/src/hooks/useMemoryGame.ts": "Implements memory card matching game logic with card flipping, match detection, move tracking, and score calculation based on number of moves.",
  "frontend/src/hooks/useNumberGuessing.ts": "Manages number guessing game state where players guess a random number 1-100, tracking attempts and providing feedback (too high/low/correct) with score based on attempts.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend API calls including user profile, leaderboards, friends management, and game result recording with automatic cache invalidation.",
  "frontend/src/hooks/useSnakeGame.ts": "Implements classic Snake game logic with keyboard controls, collision detection, food generation, canvas rendering, and score tracking based on food eaten.",
  "frontend/src/hooks/useTicTacToe.ts": "Manages Tic-Tac-Toe game state with board management, turn switching, winner detection using predefined winning combinations, and draw detection.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom neon-themed color variables (cyan and purple), imports Orbitron and Rajdhani fonts, and sets up dark mode styling for a gaming aesthetic.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component into the DOM.",
  "frontend/src/pages/FriendsPage.tsx": "Displays user's friend list with profiles from leaderboard data, allows adding friends by Principal ID, and provides a copyable user ID for sharing.",
  "frontend/src/pages/GamesPage.tsx": "Shows a grid of available games (Snake, Tic Tac Toe, Memory Cards, Number Guessing) with descriptions, icons, and play buttons linking to each game route.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero section, feature cards highlighting multiplayer and leaderboards, game previews, and top 5 leaderboard display.",
  "frontend/src/pages/LeaderboardPage.tsx": "Displays global and friends-only leaderboards in tabs, showing ranked players with avatars, scores, games played, and highlighting the current user.",
  "frontend/src/pages/LoginPage.tsx": "Handles Internet Identity authentication and auto-registers new users with default username/avatar, redirecting to home after successful login.",
  "frontend/src/pages/ProfilePage.tsx": "Shows user profile with avatar, username, Principal ID, total score, games played, and an edit profile button that opens a modal.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining a dark gaming theme with neon blue/purple colors, custom fonts (Rajdhani, Orbitron), neon glow shadows, accordion animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document describing 'Arcade Arena', a complete online gaming website with dark gaming theme, four mini-games (Snake, Tic Tac Toe, Memory, Number Guessing), Internet Identity authentication, social features, leaderboards, and user profiles built with HTML5/CSS3/JavaScript."
}