{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Arcade Arena - Frontend Implementation Plan",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Implement user authentication system with Internet Identity integration allowing users to sign up and log in, generating a unique gamer ID for each player upon registration",
      "acceptanceCriteria": [
        "Users can sign up and log in using Internet Identity",
        "Each user receives a unique gamer ID upon registration",
        "User session persists across page navigation",
        "Login/Signup page is accessible from the navigation menu"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/auth/AuthProvider.tsx",
          "operation": "create",
          "description": "Create authentication provider wrapping Internet Identity integration. Manages authentication state, provides login/logout methods, stores authenticated principal, and exposes auth context to child components. Verify the core-infrastructure component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/auth/LoginPage.tsx",
          "operation": "create",
          "description": "Create login/signup page with Internet Identity button. Display 'Arcade Arena' branding, explain authentication flow, and provide 'Sign in with Internet Identity' button. After successful authentication, call backend registerUser if user is new, then redirect to home page."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wrap application with AuthProvider to enable authentication throughout the app. Add route for /login page. Configure protected routes that require authentication before accessing."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Build Home Page with hero section displaying title 'Arcade Arena – Play With Friends Online', descriptive text about playing fun browser games, prominent 'Start Playing' call-to-action button, featured games section showing available games, top players preview displaying highest scoring users, and footer with social links",
      "acceptanceCriteria": [
        "Hero section displays title 'Arcade Arena – Play With Friends Online' prominently",
        "Descriptive text explains the browser gaming experience",
        "'Start Playing' button navigates to Games page",
        "Featured games section displays all available games with thumbnails",
        "Top players preview shows top 5 users by score",
        "Footer includes social media links and contact information"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/HomePage.tsx",
          "operation": "create",
          "description": "Create home page with hero section using generated background image frontend/public/assets/generated/hero-bg.dim_1920x1080.png. Display title 'Arcade Arena – Play With Friends Online', descriptive text, and 'Start Playing' button linking to /games. Include featured games section with game cards showing frontend/public/assets/generated/snake-icon.dim_256x256.png, frontend/public/assets/generated/tictactoe-icon.dim_256x256.png, frontend/public/assets/generated/memory-icon.dim_256x256.png, and frontend/public/assets/generated/number-icon.dim_256x256.png. Fetch and display top 5 players from backend getLeaderboard method. Add footer with social links."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register route for HomePage at root path /. Set HomePage as the default landing page for the application."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Create Games Page displaying four playable mini-games: Snake, Tic Tac Toe, Memory Card Game, and Number Guessing Game, each with a game selection interface showing game title, description, and play button to launch the selected game",
      "acceptanceCriteria": [
        "Games page displays all four games in a grid layout",
        "Each game card shows game title, brief description, and play button",
        "Clicking play button opens the selected game interface",
        "User can navigate back to game selection from any game"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/GamesPage.tsx",
          "operation": "create",
          "description": "Create games selection page displaying four game cards in responsive grid. Each card shows game icon (frontend/public/assets/generated/snake-icon.dim_256x256.png, frontend/public/assets/generated/tictactoe-icon.dim_256x256.png, frontend/public/assets/generated/memory-icon.dim_256x256.png, frontend/public/assets/generated/number-icon.dim_256x256.png), title, description, and play button. Play button navigates to individual game route."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register route for GamesPage at /games. Ensure this route is accessible from navigation menu."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Implement playable Snake game with HTML5 canvas rendering, keyboard arrow controls for snake movement, food collection mechanics that increase snake length and score, collision detection for walls and self-collision ending the game, play button to start, restart button to reset, real-time score display, and smooth animations",
      "acceptanceCriteria": [
        "Snake moves in grid-based pattern controlled by arrow keys",
        "Snake grows when eating food and score increases",
        "Game ends on wall collision or self-collision",
        "Play button starts the game",
        "Restart button resets game state",
        "Current score displays during gameplay",
        "Final score submits to backend upon game completion"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/games/SnakeGame.tsx",
          "operation": "create",
          "description": "Create Snake game component with HTML5 canvas rendering. Implement snake movement with arrow key controls, food generation, collision detection for walls and self-collision, score tracking, play/restart buttons, and real-time score display. On game end, call backend recordGameResult with GameType.snake and final score. Include back button to return to /games."
        },
        {
          "path": "frontend/src/hooks/useSnakeGame.ts",
          "operation": "create",
          "description": "Create custom hook managing Snake game state, including snake position array, direction, food position, score, game status, and game loop using requestAnimationFrame. Handle keyboard input, collision detection logic, and score calculation."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register route for SnakeGame component at /games/snake. Make this route protected to require authentication."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Implement playable Tic Tac Toe game with 3x3 grid rendering, click-to-place mechanics alternating between X and O, win detection for three in a row horizontally, vertically, or diagonally, draw detection when grid is full, AI opponent or two-player mode, play button to start, restart button to reset, score tracking based on wins, and smooth animations for piece placement",
      "acceptanceCriteria": [
        "3x3 grid displays and accepts player clicks",
        "Players alternate placing X and O markers",
        "Game detects win conditions (horizontal, vertical, diagonal)",
        "Game detects draw when all cells filled with no winner",
        "Play button starts new game",
        "Restart button resets board mid-game",
        "Score awards points for wins and submits to backend"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/games/TicTacToeGame.tsx",
          "operation": "create",
          "description": "Create Tic Tac Toe game component with 3x3 grid. Implement click-to-place mechanics alternating between X and O, win detection (horizontal, vertical, diagonal), draw detection, play/restart buttons, and score display. On game completion, calculate score based on win (100 points) or draw (50 points) and call backend recordGameResult with GameType.ticTacToe. Include back button to return to /games."
        },
        {
          "path": "frontend/src/hooks/useTicTacToe.ts",
          "operation": "create",
          "description": "Create custom hook managing Tic Tac Toe game state including board array, current player, game status, win detection logic, and draw detection. Provide methods to handle cell clicks, reset game, and check win conditions."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register route for TicTacToeGame component at /games/tictactoe. Make this route protected to require authentication."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Implement playable Memory Card Game with grid of face-down cards, click-to-flip mechanics revealing card images, matching logic that keeps matched pairs face-up and flips non-matching pairs back after brief display, move counter tracking number of attempts, completion detection when all pairs matched, play button to start, restart button to shuffle and reset, score based on number of moves (lower is better), and smooth flip animations",
      "acceptanceCriteria": [
        "Grid of face-down cards displays (minimum 12 cards, 6 pairs)",
        "Clicking card flips it face-up to reveal image",
        "Two flipped cards check for match after brief delay",
        "Matched pairs remain face-up, non-matches flip back",
        "Move counter increments with each pair attempt",
        "Game completes when all pairs matched",
        "Play button starts game with shuffled cards",
        "Restart button shuffles and resets during gameplay",
        "Score based on move count submits to backend"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/games/MemoryCardGame.tsx",
          "operation": "create",
          "description": "Create Memory Card Game component with grid of face-down cards (16 cards, 8 pairs). Implement click-to-flip mechanics, matching logic with brief delay for non-matches, move counter, completion detection, play/restart buttons, and smooth flip animations. On game completion, calculate score as (1000 - moves * 10) and call backend recordGameResult with GameType.memoryCard. Include back button to return to /games."
        },
        {
          "path": "frontend/src/hooks/useMemoryGame.ts",
          "operation": "create",
          "description": "Create custom hook managing Memory Card Game state including cards array with face-up/face-down status, flipped cards tracking, matched pairs, move counter, and game completion detection. Provide methods to handle card clicks, shuffle cards, and reset game."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register route for MemoryCardGame component at /games/memory. Make this route protected to require authentication."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Implement playable Number Guessing Game where system generates random number within configurable range (e.g., 1-100), player submits guesses via input field, system provides feedback ('too high', 'too low', or 'correct'), tracks number of attempts, displays guess history, includes play button to start new game with new random number, restart button to reset current game, score based on number of guesses (lower is better), and smooth feedback animations",
      "acceptanceCriteria": [
        "System generates random number within specified range",
        "Input field accepts player's guess",
        "System provides 'too high', 'too low', or 'correct' feedback",
        "Guess history displays all previous attempts",
        "Attempt counter tracks number of guesses",
        "Game completes when player guesses correctly",
        "Play button starts new game with new random number",
        "Restart button resets current game",
        "Score based on attempt count submits to backend"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/games/NumberGuessingGame.tsx",
          "operation": "create",
          "description": "Create Number Guessing Game component with input field for guesses, feedback display ('too high', 'too low', 'correct'), guess history list, attempt counter, play/restart buttons, and smooth feedback animations. Generate random number between 1-100. On correct guess, calculate score as (100 - attempts * 5) and call backend recordGameResult with GameType.numberGuessing. Include back button to return to /games."
        },
        {
          "path": "frontend/src/hooks/useNumberGuessing.ts",
          "operation": "create",
          "description": "Create custom hook managing Number Guessing Game state including target number, guess history array, attempt counter, game status, and feedback message. Provide methods to generate random number, process guesses, and reset game."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register route for NumberGuessingGame component at /games/number-guessing. Make this route protected to require authentication."
        }
      ]
    },
    {
      "id": "REQ-12",
      "summary": "Create Friends Page displaying user's friends list with usernames, player IDs, and latest scores, include input field and button to add new friends by entering their unique gamer ID with validation, show each friend's most recent game score, and provide invite friends functionality to share user's own gamer ID",
      "acceptanceCriteria": [
        "Friends list displays all friends with username, player ID, and latest score",
        "Input field and add button allow entering gamer ID to add friend",
        "System validates gamer ID exists before adding",
        "Each friend entry shows their most recent game score and game type",
        "Invite button displays user's own gamer ID for sharing",
        "Empty state message displays when user has no friends"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/FriendsPage.tsx",
          "operation": "create",
          "description": "Create friends page fetching friends list from backend getFriends and displaying each friend with username, player ID, and latest score. Include input field and add button to add friend by principal ID, calling backend addFriend with validation. Display user's own principal ID with copy button for sharing. Show empty state when no friends exist. Include friend profile cards with avatars using frontend/public/assets/generated/default-avatar.dim_200x200.png as fallback."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register route for FriendsPage at /friends. Make this route protected to require authentication."
        }
      ]
    },
    {
      "id": "REQ-13",
      "summary": "Create Leaderboard Page with three tabs for Global Leaderboard showing all players ranked by total score, Friends Leaderboard showing only user's friends ranked by score, and Weekly Top Players showing highest scorers from last 7 days, each displaying ranking table with position, username, player ID, and score",
      "acceptanceCriteria": [
        "Three tabs switch between Global, Friends, and Weekly leaderboards",
        "Global leaderboard displays all players sorted by total score",
        "Friends leaderboard displays only user's friends sorted by score",
        "Weekly leaderboard displays top players from last 7 days",
        "Each leaderboard shows rank position, username, player ID, and score",
        "Current user's entry is highlighted in the list",
        "Leaderboards display top 50 players with pagination if needed"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/LeaderboardPage.tsx",
          "operation": "create",
          "description": "Create leaderboard page with three tabs: Global, Friends, and Weekly. Global tab fetches from backend getLeaderboard, Friends tab fetches from backend getFriendsLeaderboard. Display ranking table with position, username, player ID, and score. Highlight current user's entry. Show trophy icon frontend/public/assets/generated/trophy-icon.dim_128x128.png for top 3 positions. Implement pagination for top 50 entries. Note: Weekly leaderboard requires backend support not yet available, display placeholder message."
        },
        {
          "path": "frontend/src/components/leaderboard/LeaderboardTable.tsx",
          "operation": "create",
          "description": "Create reusable leaderboard table component displaying rank, avatar, username, player ID, and score columns. Accept leaderboard data as props. Highlight current user row. Display trophy icon for top 3 positions. Apply neon styling to match gaming theme."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register route for LeaderboardPage at /leaderboard. Make this route protected to require authentication."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Create Profile Page displaying user's username, unique player ID, avatar image, total score, games played count, and edit profile button that opens modal or form to update username and avatar URL",
      "acceptanceCriteria": [
        "Profile page displays username, player ID, avatar, total score, and games played",
        "Player ID is displayed but not editable",
        "Edit profile button opens interface to modify username and avatar URL",
        "Form validates username is not empty before saving",
        "Updated profile data saves to backend",
        "Profile page refreshes to show updated information after save"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "create",
          "description": "Create profile page fetching user profile from backend getProfile. Display username, player ID (principal), avatar image with frontend/public/assets/generated/default-avatar.dim_200x200.png as fallback, total score, and games played count. Include edit profile button opening modal with form to update username and avatar URL. Validate username is not empty. Note: Backend currently does not support profile updates; implement frontend form and add TODO comment for future backend integration."
        },
        {
          "path": "frontend/src/components/profile/EditProfileModal.tsx",
          "operation": "create",
          "description": "Create edit profile modal component with form fields for username and avatar URL. Validate username is not empty. Include save and cancel buttons. Apply dark gaming theme styling with neon accents. Note: Backend update capability is pending; add TODO comment for future integration."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register route for ProfilePage at /profile. Make this route protected to require authentication."
        }
      ]
    },
    {
      "id": "REQ-15",
      "summary": "Implement responsive navigation menu accessible on all pages with links to Home, Games, Friends, Leaderboard, and Profile pages, including mobile hamburger menu for smaller screens, logout button when user is authenticated, and login button when user is not authenticated",
      "acceptanceCriteria": [
        "Navigation menu displays on all pages",
        "Menu includes links to Home, Games, Friends, Leaderboard, and Profile",
        "Active page is highlighted in navigation",
        "On mobile screens, menu collapses to hamburger icon",
        "Hamburger menu expands to show all navigation links",
        "Logout button displays when user is logged in",
        "Login button displays when user is not logged in"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/layout/Navigation.tsx",
          "operation": "create",
          "description": "Create navigation component with links to Home (/), Games (/games), Friends (/friends), Leaderboard (/leaderboard), and Profile (/profile). Highlight active route using React Router. Implement responsive hamburger menu for mobile screens. Display logout button when user is authenticated, login button when not authenticated. Use neon blue and purple styling matching gaming theme."
        },
        {
          "path": "frontend/src/components/layout/Layout.tsx",
          "operation": "create",
          "description": "Create layout component wrapping Navigation and page content. Ensure Navigation displays on all pages. Apply consistent dark background and spacing across all pages."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wrap all routes with Layout component to ensure Navigation appears on every page. Configure React Router to support active route highlighting."
        }
      ]
    },
    {
      "id": "REQ-16",
      "summary": "Apply dark gaming theme design with black background (#000000 or very dark gray), neon blue (#00D9FF or similar) and purple (#B931FC or similar) accent colors for highlights, buttons, and interactive elements, gamer-style fonts for headings and titles, smooth transitions and animations throughout the interface, and ensure full mobile responsiveness for all pages",
      "acceptanceCriteria": [
        "All pages use black or very dark background color",
        "Neon blue and purple colors used for buttons, borders, and highlights",
        "Headings use gamer-style display fonts",
        "Hover effects and transitions apply to interactive elements",
        "All animations run smoothly without jank",
        "Layout adapts responsively for mobile, tablet, and desktop screens",
        "Text remains readable on dark backgrounds with sufficient contrast"
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Update global styles to apply dark gaming theme. Set body background to #000000 or very dark gray. Define CSS custom properties for neon blue (#00D9FF) and purple (#B931FC) accent colors. Import gamer-style display fonts (e.g., Orbitron, Rajdhana) for headings. Add smooth transition properties to interactive elements. Ensure text color provides sufficient contrast on dark backgrounds."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Extend Tailwind configuration with custom gaming theme colors: neonBlue (#00D9FF), neonPurple (#B931FC), darkBg (#000000). Add custom font families for gamer-style headings. Configure responsive breakpoints for mobile, tablet, and desktop. Add custom animation utilities for smooth transitions and hover effects."
        }
      ]
    }
  ]
}